const App = getApp()
Page({
  data: {
    read : 1,
    _num : "1",
    newsDatas: [
      {
        tit:"这是没有读的消息",
        time: "2017.8.20",
        txt:"您的账户187****4012已于2016-02-17 16:09:35在网站，成功获得10车币"
      },
      {
        tit: "这是没有读的消息",
        time: "2017.8.20",
        txt: "您的账户187****4012已于2016-02-17 16:09:35在网站，成功获得10车币"
      },
      {
        tit: "这是没有读的消息",
        time: "2017.8.20",
        txt: "您的账户187****4012已于2016-02-17 16:09:35在网站，成功获得10车币"
      },
      {
        tit: "这是没有读的消息",
        time: "2017.8.20",
        txt: "您的账户187****4012已于2016-02-17 16:09:35在网站，成功获得10车币"
      },
      {
        tit: "这是没有读的消息",
        time: "2017.8.20",
        txt: "您的账户187****4012已于2016-02-17 16:09:35在网站，成功获得10车币"
      },
      {
        tit: "这是没有读的消息",
        time: "2017.8.20",
        txt: "您的账户187****4012已于2016-02-17 16:09:35在网站，成功获得10车币"
      },
      {
        tit: "这是没有读的消息",
        time: "2017.8.20",
        txt: "您的账户187****4012已于2016-02-17 16:09:35在网站，成功获得10车币"
      },
      {
        tit: "这是没有读的消息",
        time: "2017.8.20",
        txt: "您的账户187****4012已于2016-02-17 16:09:35在网站，成功获得10车币"
      }
    ], 
    newsDataed: [
      {
        tit: "这是没有读过了的消息",
        time: "2017.8.20",
        txt: "您的账户187****4012已于2016-02-17 16:09:35在网站，成功获得10车币"
      },
      {
        tit: "这是没有读过了的消息",
        time: "2017.8.20",
        txt: "您的账户187****4012已于2016-02-17 16:09:35在网站，成功获得10车币"
      },
      {
        tit: "这是没有读过了的消息",
        time: "2017.8.20",
        txt: "您的账户187****4012已于2016-02-17 16:09:35在网站，成功获得10车币"
      },
      {
        tit: "这是没有读过了的消息",
        time: "2017.8.20",
        txt: "您的账户187****4012已于2016-02-17 16:09:35在网站，成功获得10车币"
      },
      {
        tit: "这是没有读过了的消息",
        time: "2017.8.20",
        txt: "您的账户187****4012已于2016-02-17 16:09:35在网站，成功获得10车币"
      },
      {
        tit: "这是没有读过了的消息",
        time: "2017.8.20",
        txt: "您的账户187****4012已于2016-02-17 16:09:35在网站，成功获得10车币"
      },
      {
        tit: "这是没有读过了的消息",
        time: "2017.8.20",
        txt: "您的账户187****4012已于2016-02-17 16:09:35在网站，成功获得10车币"
      },
      {
        tit: "这是没有读过了的消息",
        time: "2017.8.20",
        txt: "您的账户187****4012已于2016-02-17 16:09:35在网站，成功获得10车币"
      }
    ]
  },
  newsRead:function(e){
    this.setData({
      read: e.currentTarget.dataset.num == '1' ? 1 : 0,
      _num: e.currentTarget.dataset.num
    })
  },
})